       IDENTIFICATION DIVISION.
       PROGRAM-ID. PLAYERS.
      * BASKETBALL PLAYER LIST
      * WRITTEN BY JACKSON WILLIAMS
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT PLAYER-FILE
       ASSIGN TO FILEIN.
       SELECT PLAYER-REPORT
       ASSIGN TO FILEOUT.
       DATA DIVISION.
       FILE SECTION.
           FD PLAYER-FILE.
           01 PLAYER-RECORD PIC X(55).
           FD PLAYER-REPORT.
           01 PLAYER-LIST PIC X(85).
       WORKING-STORAGE SECTION.
           01 WS-SWITCHES.
               05 WS-EOF-SWITCH PIC X(3).
               05 WS-FR-SWITCH PIC X(1).
           01 WS-TABLE-INJ.
               05 PIC X(13) VALUE 'DDDAY TO DAY '.
               05 PIC X(13) VALUE 'O OUT '.
               05 PIC X(13) VALUE ' NOT INJURED'.
           01 WS-INJ-TABLE REDEFINES WS-TABLE-INJ.
               05 TABLE-INJ OCCURS 3 TIMES INDEXED BY INJ-IDX.
                   10 WS-INJ-CODE PIC X(2).
                   10 WS-INJ-DESC PIC X(11).
           01 WS-HOLD-FIELDS.
               05 WS-HOLD-POS PIC X(2) VALUE SPACES.
               05 WS-HOLD-INJ PIC X(2) VALUE SPACES.
               05 WS-HOLD-REC PIC X(55) VALUE SPACES.
               05 WS-HOLD-CUR PIC X(55) VALUE SPACES.
           01 WS-ACCUM.
               05 WS-ACC-PLAYERS PIC 9(2) VALUE ZERO.
               05 WS-ACC-POINTS PIC 9(5) VALUE ZERO.
               05 WS-ACC-ASSIST PIC 9(5) VALUE ZERO.
               05 WS-ACC-3-PTRS PIC 9(5) VALUE ZERO.
               05 WS-ACC-REBOUNDS PIC 9(5) VALUE ZERO.
               05 WS-ACC-BLOCKS PIC 9(5) VALUE ZERO.
               05 WS-ACC-AVERAGE PIC 9(5) VALUE ZERO.
               05 WS-ACC-INJURIES PIC 9(5) VALUE ZERO.
               05 WS-ACC-PLAY-POS PIC 9(5) VALUE ZERO.
           01 PR-PLAYER-RECORD.
               05 PR-PLAYER-ID PIC X(4).
               05 PR-FIRST-NAME PIC X(12).
               05 PR-LAST-NAME PIC X(14).
               05 PR-POSITION PIC X(2).
               05 PR-INJURIES PIC X(2).
               05 PR-POINTS PIC 9(4).
               05 PR-ASSISTS PIC 9(4).
               05 PR-3-POINTERS PIC 9(4).
               05 PR-REBOUNDS PIC 9(4).
               05 PR-BLOCKS PIC 9(4).
           01 PL-PLAYER-LIST.
               05 PIC X(3) VALUE SPACES.
               05 PL-PLAYER-ID PIC X(4).
               05 PIC X(2) VALUE SPACES.
               05 PL-FIRST-NAME PIC X(12).
               05 PIC X(2) VALUE SPACES.
               05 PL-LAST-NAME PIC X(14).
               05 PIC X(2) VALUE SPACES.
               05 PL-POSITION PIC X(2).
               05 PIC X(2) VALUE SPACES.
               05 PL-INJURIES PIC X(11).
           05 PIC X(2) VALUE SPACES.
           05 PL-POINTS PIC 9(4).
           05 PIC X(2) VALUE SPACES.
           05 PL-ASSISTS PIC 9(4).
           05 PIC X(2) VALUE SPACES.
           05 PL-3-POINTERS PIC 9(4).
           05 PIC X(2) VALUE SPACES.
           05 PL-REBOUNDS PIC 9(4).
           05 PIC X(2) VALUE SPACES.
           05 PL-BLOCKS PIC 9(4).
           01 WS-HDG-1.
           05 PIC X(28) VALUE SPACES.
           05 PIC X(22) VALUE
           'THAT LOCAL SPORTS TEAM'.
           05 PIC X(13) VALUE SPACES.
           05 WS-HDG-DATE.
           10 DATE-MM PIC X(2) VALUE SPACES.
           10 PIC X(1) VALUE '-'.
           10  DATE-DD PIC X(2) VALUE SPACES.
           10 PIC X(1) VALUE '-'.
           10 DATE-YYYY PIC X(4) VALUE SPACES.
           05 PIC X(3) VALUE SPACES.

           01 WS-HDG-2.
           05 PIC X(33) VALUE SPACES.
           05 PIC X(11) VALUE
           'TEAM ROSTER'.
           05 PIC X(19) VALUE SPACES.
           05 PIC X(6) VALUE 'PAGE: '.
           05 WS-PAGE-NO PIC 9(2) VALUE ZEROES.
           05 PIC X(5) VALUE SPACES.
           01 WS-HDG-P.
           05 PIC X(3) VALUE SPACES.
           05 PIC X(10) VALUE
           'POSITION: '.
           05 WS-HDG-POS PIC X(2) VALUE SPACES.
           05 PIC X(61) VALUE SPACES.
           01 WS-HDG-3.
           05 PIC X(3) VALUE SPACES.
           05 PIC X(6) VALUE
           'PID '.
           05 PIC X(14) VALUE
           'FIRST NAME '.
           05 PIC X(16) VALUE
           'LAST NAME '.
           05 PIC X(4) VALUE
           'POS '.
           05 PIC X(13) VALUE
           'INJURIES '.
           05 PIC X(6) VALUE
           'PNTS '.
           05 PIC X(6) VALUE
           'ASST '.
           05 PIC X(6) VALUE
           '3PTS '.
           05 PIC X(6) VALUE
           'REBS '.
           05 PIC X(6) VALUE
           'BLKS '.
           05 PIC X(5) VALUE SPACES.
           01 WS-HDG-INJ.
           05 PIC X(17) VALUE SPACES.
           05 PIC X(14) VALUE
           'INJURY TOTAL: '.
           05 WS-TOT-INJ PIC ZZZ9 VALUE ZERO.
           05 PIC X(41) VALUE SPACES.
           01 WS-HDG-PLAYERS.
           05 PIC X(17) VALUE SPACES.
           05 PIC X(14) VALUE
           'PLAYER TOTAL: '.
           05 WS-TOT-PLAYER PIC ZZZ9 VALUE ZERO.
           05 PIC X(41) VALUE SPACES.
           01 WS-TOTAL-LINE.
           05 WS-LINE-TOTAL.
           10 PIC X(3) VALUE SPACES.
           10 PIC X(7) VALUE 'TOTALS:'.
           10 PIC X(66) VALUE SPACES.
           05 WS-TOTAL-PLAYERS.
           10 PIC X(8) VALUE SPACES.
           10 PIC X(8) VALUE 'PLAYERS:'.
           10 PIC X(5) VALUE SPACES.
           10 WS-PLAYERS-TOT PIC Z9 VALUE ZERO.
           10 PIC X(53) VALUE SPACES.
           05 WS-TOTAL-POINTS.
           10 PIC X(9) VALUE SPACES.
           10 PIC X(8) VALUE 'POINTS: '.
           10 WS-POINTS-TOT PIC ZZ,ZZ9 VALUE ZERO.
           10 PIC X(53) VALUE SPACES.
           05 WS-TOTAL-ASSISTS.
           10 PIC X(9) VALUE SPACES.
           10 PIC X(8) VALUE 'ASSIST: '.
           10 WS-ASSIST-TOT PIC ZZ,ZZ9 VALUE ZERO.
           10 PIC X(53) VALUE SPACES.
           05 WS-TOTAL-3-PTRS.
           10 PIC X(9) VALUE SPACES.
           10 PIC X(8) VALUE '3 PTRS: '.
           10 WS-3-PTRS-TOT PIC ZZ,ZZ9 VALUE ZERO.
           10 PIC X(53) VALUE SPACES.
           05 WS-TOTAL-REBOUNDS.
           10 PIC X(7) VALUE SPACES.
           10 PIC X(10) VALUE 'REBOUNDS: '.
           10 WS-REBOUNDS-TOT PIC ZZ,ZZ9 VALUE ZERO.
           10 PIC X(53) VALUE SPACES.
           05 WS-TOTAL-BLOCKS.
           10 PIC X(9) VALUE SPACES.
           10 PIC X(8) VALUE 'BLOCKS: '.
           10 WS-BLOCKS-TOT PIC ZZ,ZZ9 VALUE ZERO.
           10 PIC X(53) VALUE SPACES.
           05 WS-AVG-PTS.
           10 PIC X(4) VALUE SPACES.
           10 PIC X(13) VALUE 'AVERAGE PTS: '.
           10 WS-AVG-POINTS PIC ZZ,ZZ9 VALUE ZERO.
           10 PIC X(53) VALUE SPACES.
       PROCEDURE DIVISION.
       100-MAINLINE.
           OPEN INPUT PLAYER-FILE
           OUTPUT PLAYER-REPORT
           MOVE 'NO' TO WS-EOF-SWITCH
           MOVE FUNCTION CURRENT-DATE (1:4) TO DATE-YYYY
           MOVE FUNCTION CURRENT-DATE (5:2) TO DATE-MM
           MOVE FUNCTION CURRENT-DATE (7:2) TO DATE-DD
           MOVE 1 TO WS-PAGE-NO
           MOVE 'Y' TO WS-FR-SWITCH
           WRITE PLAYER-LIST FROM WS-HDG-1
           WRITE PLAYER-LIST FROM WS-HDG-2
           WRITE PLAYER-LIST FROM WS-HDG-3
           AFTER ADVANCING 1 LINE
           PERFORM UNTIL WS-EOF-SWITCH = 'YES'
               READ PLAYER-FILE INTO PR-PLAYER-RECORD
                   AT END
                       MOVE 'YES' TO WS-EOF-SWITCH
                   NOT AT END
                       PERFORM 200-PROCESS
               END-READ
           END-PERFORM
           MOVE WS-ACC-PLAY-POS TO WS-TOT-PLAYER
           WRITE PLAYER-LIST FROM WS-HDG-PLAYERS
           MOVE WS-ACC-INJURIES TO WS-TOT-INJ
           WRITE PLAYER-LIST FROM WS-HDG-INJ
           COMPUTE WS-ACC-AVERAGE = WS-ACC-POINTS / WS-ACC-PLAYERS
           MOVE WS-ACC-PLAYERS TO WS-PLAYERS-TOT
           MOVE WS-ACC-POINTS TO WS-POINTS-TOT
           MOVE WS-ACC-ASSIST TO WS-ASSIST-TOT
           MOVE WS-ACC-3-PTRS TO WS-3-PTRS-TOT 
           MOVE WS-ACC-REBOUNDS TO WS-REBOUNDS-TOT
           MOVE WS-ACC-BLOCKS TO WS-BLOCKS-TOT
           MOVE WS-ACC-AVERAGE TO WS-AVG-POINTS
           WRITE PLAYER-LIST FROM WS-LINE-TOTAL
           WRITE PLAYER-LIST FROM WS-TOTAL-PLAYERS
           WRITE PLAYER-LIST FROM WS-TOTAL-POINTS
           WRITE PLAYER-LIST FROM WS-TOTAL-ASSISTS
           WRITE PLAYER-LIST FROM WS-TOTAL-3-PTRS
           WRITE PLAYER-LIST FROM WS-TOTAL-REBOUNDS
           WRITE PLAYER-LIST FROM WS-TOTAL-BLOCKS
           WRITE PLAYER-LIST FROM WS-AVG-PTS
           CLOSE PLAYER-FILE
           PLAYER-REPORT
           STOP RUN
           .
       200-PROCESS.
           IF WS-FR-SWITCH = 'Y'
            MOVE PR-POSITION TO WS-HDG-POS
            WRITE PLAYER-LIST FROM WS-HDG-P
            MOVE 'N' TO WS-FR-SWITCH
            MOVE PR-POSITION TO WS-HOLD-POS
            MOVE PR-INJURIES TO WS-HOLD-INJ
           END-IF
           IF WS-HOLD-POS = PR-POSITION
            IF WS-HOLD-INJ = PR-INJURIES
            PERFORM 210-MOVE-DATA
            MOVE PR-PLAYER-RECORD TO WS-HOLD-REC
            ELSE
            MOVE PR-INJURIES TO WS-HOLD-INJ
            MOVE PR-PLAYER-RECORD TO WS-HOLD-CUR
            MOVE WS-HOLD-CUR TO PR-PLAYER-RECORD
            PERFORM 210-MOVE-DATA
           ELSE
            MOVE WS-ACC-PLAY-POS TO WS-TOT-PLAYER
            WRITE PLAYER-LIST FROM WS-HDG-PLAYERS
            MOVE WS-ACC-INJURIES TO WS-TOT-INJ
            WRITE PLAYER-LIST FROM WS-HDG-INJ
            MOVE 0 TO WS-ACC-INJURIES
            MOVE 0 TO WS-ACC-PLAY-POS
            MOVE PR-POSITION TO WS-HOLD-POS
            MOVE PR-PLAYER-RECORD TO WS-HOLD-CUR
            MOVE PR-POSITION TO WS-HDG-POS
            WRITE PLAYER-LIST FROM WS-HDG-P
            WRITE PLAYER-LIST FROM WS-HDG-3
            MOVE WS-HOLD-CUR TO PR-PLAYER-RECORD
            PERFORM 210-MOVE-DATA
           END-IF
           .
           210-MOVE-DATA.
           MOVE PR-PLAYER-ID TO PL-PLAYER-ID
           MOVE PR-FIRST-NAME TO PL-FIRST-NAME
           MOVE PR-LAST-NAME TO PL-LAST-NAME
           MOVE PR-POSITION TO PL-POSITION
           PERFORM 211-SEARCH-INJ
           MOVE PR-POINTS TO PL-POINTS
           MOVE PR-ASSISTS TO PL-ASSISTS
           MOVE PR-3-POINTERS TO PL-3-POINTERS
           MOVE PR-REBOUNDS TO PL-REBOUNDS
           MOVE PR-BLOCKS TO PL-BLOCKS
           COMPUTE WS-ACC-PLAYERS = WS-ACC-PLAYERS + 1
           COMPUTE WS-ACC-PLAY-POS = WS-ACC-PLAY-POS + 1
           COMPUTE WS-ACC-POINTS = WS-ACC-POINTS + PR-POINTS
           COMPUTE WS-ACC-ASSIST = WS-ACC-ASSIST + PR-ASSISTS
           COMPUTE WS-ACC-3-PTRS = WS-ACC-3-PTRS + PR-3-POINTERS
           COMPUTE WS-ACC-REBOUNDS = WS-ACC-REBOUNDS + PR-REBOUNDS
           COMPUTE WS-ACC-BLOCKS = WS-ACC-BLOCKS + PR-BLOCKS
           IF PR-INJURIES > SPACES
            COMPUTE WS-ACC-INJURIES = WS-ACC-INJURIES + 1
           END-IF
           WRITE PLAYER-LIST FROM PL-PLAYER-LIST
           AFTER ADVANCING 2 LINES
           .
           211-SEARCH-INJ.
           SET INJ-IDX TO 1
           SEARCH TABLE-INJ
           WHEN
           PR-INJURIES = WS-INJ-CODE (INJ-IDX)
            MOVE WS-INJ-DESC (INJ-IDX) TO PL-INJURIES
           END-SEARCH.
