000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. PLAYERS.
000003 * BASKETBALL PLAYER LIST
000004 * WRITTEN BY JACKSON WILLIAMS 
000005 ENVIRONMENT DIVISION.
000006 INPUT-OUTPUT SECTION.
000007 FILE-CONTROL.
000008 SELECT PLAYER-FILE 
000009 ASSIGN TO FILEIN.
000010 SELECT PLAYER-REPORT
000011 ASSIGN TO FILEOUT.
000012 DATA DIVISION.
000013 FILE SECTION.
000014 FD PLAYER-FILE. 
000015 01 PLAYER-RECORD PIC X(55).
000016 FD PLAYER-REPORT. 
000017 01 PLAYER-LIST PIC X(85).
000018 WORKING-STORAGE SECTION.
000019 01 WS-SWITCHES.
000020 05 WS-EOF-SWITCH PIC X(3).
000021 05 WS-FR-SWITCH PIC X(1).
000022 01 WS-TABLE-INJ.
000023 05 PIC X(13) VALUE 'DDDAY TO DAY '.
000024 05 PIC X(13) VALUE 'O OUT '.
000025 05 PIC X(13) VALUE ' NOT INJURED'.
000026 01 WS-INJ-TABLE REDEFINES WS-TABLE-INJ.
000027 05 TABLE-INJ OCCURS 3 TIMES INDEXED BY INJ-IDX. 
000028 10 WS-INJ-CODE PIC X(2). 
000029 10 WS-INJ-DESC PIC X(11). 
000030 01 WS-HOLD-FIELDS. 
000031 05 WS-HOLD-POS PIC X(2) VALUE SPACES. 
000032 05 WS-HOLD-INJ PIC X(2) VALUE SPACES. 
000033 05 WS-HOLD-REC PIC X(55) VALUE SPACES. 
000034 05 WS-HOLD-CUR PIC X(55) VALUE SPACES. 
000035 01 WS-ACCUM. 
000036 05 WS-ACC-PLAYERS PIC 9(2) VALUE ZERO. 
000037 05 WS-ACC-POINTS PIC 9(5) VALUE ZERO. 
000038 05 WS-ACC-ASSIST PIC 9(5) VALUE ZERO. 
000039 05 WS-ACC-3-PTRS PIC 9(5) VALUE ZERO. 
000040 05 WS-ACC-REBOUNDS PIC 9(5) VALUE ZERO.
000041 05 WS-ACC-BLOCKS PIC 9(5) VALUE ZERO.
000042 05 WS-ACC-AVERAGE PIC 9(5) VALUE ZERO.
000043 05 WS-ACC-INJURIES PIC 9(5) VALUE ZERO.
000044 05 WS-ACC-PLAY-POS PIC 9(5) VALUE ZERO.
000045 01 PR-PLAYER-RECORD.
000046 05 PR-PLAYER-ID PIC X(4). 
000047 05 PR-FIRST-NAME PIC X(12).
000048 05 PR-LAST-NAME PIC X(14). 
000049 05 PR-POSITION PIC X(2). 
000050 05 PR-INJURIES PIC X(2). 
000051 05 PR-POINTS PIC 9(4).
000052 05 PR-ASSISTS PIC 9(4). 
000053 05 PR-3-POINTERS PIC 9(4). 
000054 05 PR-REBOUNDS PIC 9(4). 
000055 05 PR-BLOCKS PIC 9(4). 
000056 01 PL-PLAYER-LIST. 
000057 05 PIC X(3) VALUE SPACES. 
000058 05 PL-PLAYER-ID PIC X(4).
000059 05 PIC X(2) VALUE SPACES.
000060 05 PL-FIRST-NAME PIC X(12).
000061 05 PIC X(2) VALUE SPACES.
000062 05 PL-LAST-NAME PIC X(14).
000063 05 PIC X(2) VALUE SPACES.
000064 05 PL-POSITION PIC X(2).
000065 05 PIC X(2) VALUE SPACES.
000066 05 PL-INJURIES PIC X(11).
000067 05 PIC X(2) VALUE SPACES.
000068 05 PL-POINTS PIC 9(4).
000069 05 PIC X(2) VALUE SPACES.
000070 05 PL-ASSISTS PIC 9(4).
000071 05 PIC X(2) VALUE SPACES.
000072 05 PL-3-POINTERS PIC 9(4).
000073 05 PIC X(2) VALUE SPACES.
000074 05 PL-REBOUNDS PIC 9(4).
000075 05 PIC X(2) VALUE SPACES.
000076 05 PL-BLOCKS PIC 9(4).
000077 01 WS-HDG-1.
000078 05 PIC X(28) VALUE SPACES.
000079 05 PIC X(22) VALUE
000080 'THAT LOCAL SPORTS TEAM'.
000081 05 PIC X(13) VALUE SPACES.
000082 05 WS-HDG-DATE.
000083 10 DATE-MM PIC X(2) VALUE SPACES.
000084 10 PIC X(1) VALUE '-'.
 000085 10 DATE-DD PIC X(2) VALUE SPACES.
000086 10 PIC X(1) VALUE '-'.
000087 10 DATE-YYYY PIC X(4) VALUE SPACES.
000088 05 PIC X(3) VALUE SPACES.
000089
000090 01 WS-HDG-2.
000091 05 PIC X(33) VALUE SPACES.
000092 05 PIC X(11) VALUE
000093 'TEAM ROSTER'.
000094 05 PIC X(19) VALUE SPACES.
000095 05 PIC X(6) VALUE 'PAGE: '.
000096 05 WS-PAGE-NO PIC 9(2) VALUE ZEROES.
000097 05 PIC X(5) VALUE SPACES.
000098 01 WS-HDG-P.
000099 05 PIC X(3) VALUE SPACES.
000100 05 PIC X(10) VALUE
000101 'POSITION: '.
000102 05 WS-HDG-POS PIC X(2) VALUE SPACES.
000103 05 PIC X(61) VALUE SPACES.
000104 01 WS-HDG-3.
000105 05 PIC X(3) VALUE SPACES.
000106 05 PIC X(6) VALUE
000107 'PID '.
000108 05 PIC X(14) VALUE
000109 'FIRST NAME '.
000110 05 PIC X(16) VALUE
000111 'LAST NAME '.
000112 05 PIC X(4) VALUE 
000113 'POS '. 
000114 05 PIC X(13) VALUE 
000115 'INJURIES '.
000116 05 PIC X(6) VALUE
000117 'PNTS '.
000118 05 PIC X(6) VALUE
000119 'ASST '. 
000120 05 PIC X(6) VALUE
000121 '3PTS '.
000122 05 PIC X(6) VALUE
000123 'REBS '.
000124 05 PIC X(6) VALUE
000125 'BLKS '.
000126 05 PIC X(5) VALUE SPACES.
000127 01 WS-HDG-INJ.
000128 05 PIC X(17) VALUE SPACES.
000129 05 PIC X(14) VALUE
000130 'INJURY TOTAL: '.
000131 05 WS-TOT-INJ PIC ZZZ9 VALUE ZERO.
000132 05 PIC X(41) VALUE SPACES.
000133 01 WS-HDG-PLAYERS.
000134 05 PIC X(17) VALUE SPACES.
000135 05 PIC X(14) VALUE
000136 'PLAYER TOTAL: '.
000137 05 WS-TOT-PLAYER PIC ZZZ9 VALUE ZERO.
000138 05 PIC X(41) VALUE SPACES.
000139 01 WS-TOTAL-LINE.
000140 05 WS-LINE-TOTAL. 
000141 10 PIC X(3) VALUE SPACES.
000142 10 PIC X(7) VALUE 'TOTALS:'.
000143 10 PIC X(66) VALUE SPACES.
000144 05 WS-TOTAL-PLAYERS.
000145 10 PIC X(8) VALUE SPACES.
000146 10 PIC X(8) VALUE 'PLAYERS:'.
000147 10 PIC X(5) VALUE SPACES.
000148 10 WS-PLAYERS-TOT PIC Z9 VALUE ZERO.
000149 10 PIC X(53) VALUE SPACES.
000150 05 WS-TOTAL-POINTS.
000151 10 PIC X(9) VALUE SPACES.
000152 10 PIC X(8) VALUE 'POINTS: '.
000153 10 WS-POINTS-TOT PIC ZZ,ZZ9 VALUE ZERO.
000154 10 PIC X(53) VALUE SPACES.
000155 05 WS-TOTAL-ASSISTS.
000156 10 PIC X(9) VALUE SPACES.
000157 10 PIC X(8) VALUE 'ASSIST: '.
000158 10 WS-ASSIST-TOT PIC ZZ,ZZ9 VALUE ZERO.
000159 10 PIC X(53) VALUE SPACES.
000160 05 WS-TOTAL-3-PTRS. 
000161 10 PIC X(9) VALUE SPACES.
000162 10 PIC X(8) VALUE '3 PTRS: '.
000163 10 WS-3-PTRS-TOT PIC ZZ,ZZ9 VALUE ZERO.
000164 10 PIC X(53) VALUE SPACES.
000165 05 WS-TOTAL-REBOUNDS.
000166 10 PIC X(7) VALUE SPACES. 
000167 10 PIC X(10) VALUE 'REBOUNDS: '.
000168 10 WS-REBOUNDS-TOT PIC ZZ,ZZ9 VALUE ZERO.
000169 10 PIC X(53) VALUE SPACES.
000170 05 WS-TOTAL-BLOCKS.
000171 10 PIC X(9) VALUE SPACES.
000172 10 PIC X(8) VALUE 'BLOCKS: '.
000173 10 WS-BLOCKS-TOT PIC ZZ,ZZ9 VALUE ZERO.
000174 10 PIC X(53) VALUE SPACES.
000175 05 WS-AVG-PTS.
000176 10 PIC X(4) VALUE SPACES.
000177 10 PIC X(13) VALUE 'AVERAGE PTS: '.
000178 10 WS-AVG-POINTS PIC ZZ,ZZ9 VALUE ZERO.
000179 10 PIC X(53) VALUE SPACES.
000180 PROCEDURE DIVISION.
000181 100-MAINLINE.
000182 OPEN INPUT PLAYER-FILE
000183 OUTPUT PLAYER-REPORT
000184 MOVE 'NO' TO WS-EOF-SWITCH
000185 MOVE FUNCTION CURRENT-DATE (1:4) TO DATE-YYYY
000186 MOVE FUNCTION CURRENT-DATE (5:2) TO DATE-MM
000187 MOVE FUNCTION CURRENT-DATE (7:2) TO DATE-DD
000188 MOVE 1 TO WS-PAGE-NO
000189 MOVE 'Y' TO WS-FR-SWITCH
000190 WRITE PLAYER-LIST FROM WS-HDG-1
000191 WRITE PLAYER-LIST FROM WS-HDG-2
000192 WRITE PLAYER-LIST FROM WS-HDG-3
000193 AFTER ADVANCING 1 LINE
000194 PERFORM UNTIL WS-EOF-SWITCH = 'YES'
000195 1 READ PLAYER-FILE INTO PR-PLAYER-RECORD
000196 1 AT END
000197 2 MOVE 'YES' TO WS-EOF-SWITCH
000198 1 NOT AT END
000199 2 PERFORM 200-PROCESS
000200 1 END-READ
00201 END-PERFORM
00202 MOVE WS-ACC-PLAY-POS TO WS-TOT-PLAYER
00203 WRITE PLAYER-LIST FROM WS-HDG-PLAYERS
00204 MOVE WS-ACC-INJURIES TO WS-TOT-INJ
00205 WRITE PLAYER-LIST FROM WS-HDG-INJ
00206 COMPUTE WS-ACC-AVERAGE = WS-ACC-POINTS / WS-ACC-PLAYERS
00207 MOVE WS-ACC-PLAYERS TO WS-PLAYERS-TOT 
000208 MOVE WS-ACC-POINTS TO WS-POINTS-TOT 
000209 MOVE WS-ACC-ASSIST TO WS-ASSIST-TOT 
000210 MOVE WS-ACC-3-PTRS TO WS-3-PTRS-TOT 
000211 MOVE WS-ACC-REBOUNDS TO WS-REBOUNDS-TOT
000212 MOVE WS-ACC-BLOCKS TO WS-BLOCKS-TOT
000213 MOVE WS-ACC-AVERAGE TO WS-AVG-POINTS
000214 WRITE PLAYER-LIST FROM WS-LINE-TOTAL 
000215 WRITE PLAYER-LIST FROM WS-TOTAL-PLAYERS 
000216 WRITE PLAYER-LIST FROM WS-TOTAL-POINTS 
000217 WRITE PLAYER-LIST FROM WS-TOTAL-ASSISTS 
000218 WRITE PLAYER-LIST FROM WS-TOTAL-3-PTRS 
000219 WRITE PLAYER-LIST FROM WS-TOTAL-REBOUNDS 
000220 WRITE PLAYER-LIST FROM WS-TOTAL-BLOCKS
000221 WRITE PLAYER-LIST FROM WS-AVG-PTS
000222 CLOSE PLAYER-FILE 
000223 PLAYER-REPORT
000224 STOP RUN 
000225 . 
000226 200-PROCESS. 
000227 IF WS-FR-SWITCH = 'Y' 
000228 1 MOVE PR-POSITION TO WS-HDG-POS 
000229 1 WRITE PLAYER-LIST FROM WS-HDG-P 
000230 1 MOVE 'N' TO WS-FR-SWITCH
000231 1 MOVE PR-POSITION TO WS-HOLD-POS 
000232 1 MOVE PR-INJURIES TO WS-HOLD-INJ
000233 END-IF 
000234 IF WS-HOLD-POS = PR-POSITION 
000235 1 IF WS-HOLD-INJ = PR-INJURIES 
000236 2 PERFORM 210-MOVE-DATA 
000237 2 MOVE PR-PLAYER-RECORD TO WS-HOLD-REC 
000238 1 ELSE 
000239 2 MOVE PR-INJURIES TO WS-HOLD-INJ 
000240 2 MOVE PR-PLAYER-RECORD TO WS-HOLD-CUR 
000241 2 MOVE WS-HOLD-CUR TO PR-PLAYER-RECORD 
000242 2 PERFORM 210-MOVE-DATA 
000243 ELSE 
000244 1 MOVE WS-ACC-PLAY-POS TO WS-TOT-PLAYER 
000245 1 WRITE PLAYER-LIST FROM WS-HDG-PLAYERS 
000246 1 MOVE WS-ACC-INJURIES TO WS-TOT-INJ 
000247 1 WRITE PLAYER-LIST FROM WS-HDG-INJ 
000248 1 MOVE 0 TO WS-ACC-INJURIES 
000249 1 MOVE 0 TO WS-ACC-PLAY-POS 
000250 1 MOVE PR-POSITION TO WS-HOLD-POS 
000251 1 MOVE PR-PLAYER-RECORD TO WS-HOLD-CUR 
000252 1 MOVE PR-POSITION TO WS-HDG-POS 
000253 1 WRITE PLAYER-LIST FROM WS-HDG-P 
000254 1 WRITE PLAYER-LIST FROM WS-HDG-3 
000255 1 MOVE WS-HOLD-CUR TO PR-PLAYER-RECORD 
000256 1 PERFORM 210-MOVE-DATA 
000257 END-IF 
000258 . 
000259 210-MOVE-DATA. 
000260 MOVE PR-PLAYER-ID TO PL-PLAYER-ID 
000261 MOVE PR-FIRST-NAME TO PL-FIRST-NAME 
000262 MOVE PR-LAST-NAME TO PL-LAST-NAME 
000263 MOVE PR-POSITION TO PL-POSITION 
000264 PERFORM 211-SEARCH-INJ 
000265 MOVE PR-POINTS TO PL-POINTS 
000266 MOVE PR-ASSISTS TO PL-ASSISTS
000267 MOVE PR-3-POINTERS TO PL-3-POINTERS
000268 MOVE PR-REBOUNDS TO PL-REBOUNDS
000269 MOVE PR-BLOCKS TO PL-BLOCKS
000270 COMPUTE WS-ACC-PLAYERS = WS-ACC-PLAYERS + 1
000271 COMPUTE WS-ACC-PLAY-POS = WS-ACC-PLAY-POS + 1
000272 COMPUTE WS-ACC-POINTS = WS-ACC-POINTS + PR-POINTS
000273 COMPUTE WS-ACC-ASSIST = WS-ACC-ASSIST + PR-ASSISTS
000274 COMPUTE WS-ACC-3-PTRS = WS-ACC-3-PTRS + PR-3-POINTERS
000275 COMPUTE WS-ACC-REBOUNDS = WS-ACC-REBOUNDS + PR-REBOUNDS
000276 COMPUTE WS-ACC-BLOCKS = WS-ACC-BLOCKS + PR-BLOCKS
000277 IF PR-INJURIES > SPACES
000278 1 COMPUTE WS-ACC-INJURIES = WS-ACC-INJURIES + 1
000279 END-IF
000280 WRITE PLAYER-LIST FROM PL-PLAYER-LIST 
000281 AFTER ADVANCING 2 LINES
000282 . 
000283 211-SEARCH-INJ. 
000284 SET INJ-IDX TO 1 
000285 SEARCH TABLE-INJ 
000286 WHEN 
000287 PR-INJURIES = WS-INJ-CODE (INJ-IDX) 
000288 1 MOVE WS-INJ-DESC (INJ-IDX) TO PL-INJURIES 
000289 END-SEARCH.  
